import React from "react";

const Footer = () => {
    return (
        <div className="row">
            <div className="col-12">
                <div>
                    <h3>Props এবং State এর মধ্যে পার্থক্য কি?</h3>
                    <p>
                        <span className="fw-bold">উত্তর:</span>
                        <br />
                        <span className="fw-bold">Props:</span>
                        <br />
                        <li>
                            ডাটা এক কম্পোনেন্ট থেকে অন্য কম্পোনেন্টে পাঠানো হয়।
                        </li>
                        <li>
                            State এবং ফাংশনাল কম্পোনেন্টের সাথে Props ব্যবহার
                            করা যেতে পারে।
                        </li>
                        <li>Props পরিবর্তন বা মডিফাই করা যায় না।</li>
                        <li>Props শুধুমাত্র read করা যায়।</li>
                        <br />
                        <span className="fw-bold">State: </span>
                        <li>ডাটা শুধুমাত্র কম্পোনেন্টের মধ্যে পাস করা যায়।</li>
                        <li>
                            State শুধুমাত্র state কম্পোনেন্ট বা ক্লাস
                            কম্পোনেন্টের সাথে ব্যবহার করা যেতে পারে।
                        </li>
                        <li>State পরিবর্তন বা মডিফাই করা যায়।</li>
                        <li> State, read এবং write উভয় করা যায়।</li>
                    </p>
                </div>
                <div>
                    <h3>রিয়েক্ট কিভাবে কাজ করে?</h3>
                    <p>
                        <span className="fw-bold">উত্তরঃ</span> <br />
                        রিঅ্যাক্ট একটা সেইম টু সেইম ব্রাউজারের ডমের মতো করে
                        আরেকটা ডম তৈরী করে যেটাকে ভার্চুয়াল ডম বলা হয়। এখন এই ডম
                        দেখতে পুরো সেই আসল ডমের মতোই, কিন্তু এই ভার্চুয়াল ডমটা
                        আসলে একটা জাভাস্ক্রিপ্ট অবজেক্ট। রিঅ্যাক্ট এটাকে এমনভাবে
                        তৈরী করে যে এই ডমের সাথে সহজেই জাভাস্ক্রিপ্ট ইউজ করে
                        যেকোনো ইলিমেন্ট মডিফাই করা যায় কম সময়ের মধ্যে এবং
                        এফিসিয়েন্টলি। এখন এখানেও রিঅ্যাক্ট আরেকটা কাজ করে।
                        রিঅ্যাক্ট একটা না বরং দুইটা ভার্চুয়াল ডম তৈরী করে। ইউজার
                        যখন রিঅ্যাক্ট অ্যাপের মধ্যে কোনো অ্যাকশন নেয় বা আমরা
                        যেটা বলি ডমে কোনো চেঞ্জ আনার মতো কিছু করে তখন রিঅ্যাক্ট
                        দুইটা ভার্চুয়াল ডমের মধ্যে একটাতে সেই চেঞ্জগুলো রাখে, আর
                        আরেকটা থাকে আগের ভার্শনের। এখন আগেরটার সাথে নতুনটার
                        তুলনা করে রিঅ্যাক্ট দেখে আসলে স্পেসেফিক ঠিক কোন ইলিমেন্ট
                        পরিবর্তন করা হয়েছে। সে অনুসারে রিঅ্যাক্ট পুরো ডমটাকে
                        রি-রেন্ডার না করে শুধুমাত্র যেই জিনিসটা চেঞ্জ হয়েছে
                        সেটাকেই চেঞ্জ করে। এতে সহজেই দ্রুত কাজ হয়ে যায় আর
                        অতিরিক্ত, অপ্রয়োজনীয় কোনো কাজও করতে হয় না ব্রাউজারের। আর
                        এভাবেই, এই টেকনিক ইউজ করেই রিঅ্যাক্ট এতো ফাস্ট রেন্ডার
                        করতে পারে।
                    </p>
                </div>
                <div>
                    <h3>useState কিভাবে কাজ করে?</h3>
                    <p>
                        <span className="fw-bold">উত্তরঃ</span> <br />
                        useState হচ্ছে একটি ফাংশন। এই ফাংশন থেকে আমরা একটি array
                        রিটার্ন পাই। array এরে মধ্যে ২ টি এলিমেন্ট থাকে। ১ম
                        ইনডেক্সে ইনিশিয়াল ভ্যালু এবং ২য় ইনডেক্সে একটি ফাংশন থাকে
                        এবং এই ফাংশনের মাধ্যমেই আমরা state ডাটা আপডেট করি।
                        Destructuring এর মাধ্যমে আমরা useState থেকে ইনিশিয়াল
                        ভ্যালু এবং ফাংশনটি ২টি ভেরিয়েবলে সেট করে দেই।
                    </p>
                </div>
            </div>
        </div>
    );
};

export default Footer;
